app/views/users/show.html.erb

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = ?  [["user_id", 6]]
---
    <% @liked_bookmarks.each do |like| %>
      <% bookmark = Bookmark.find(like.bookmark_id) %>