app/controllers/bookmarks_controller.rb

  def create
    @bookmark = Bookmark.new(bookmark_params)
    @bookmark.topic_id = params[:topic_id]

    if @bookmark.save
---
INSERT INTO "bookmarks" ("url", "topic_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["url", "2"], ["topic_id", 6], ["user_id", 6], ["created_at", "2018-03-07 20:32:51.140457"], ["updated_at", "2018-03-07 20:32:51.140457"]]

  def edit
    @topic = Topic.find(params[:topic_id])
    @bookmark = Bookmark.find(params[:id])
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", 20]]

  def update
    @topic = Topic.find(params[:topic_id])
    @bookmark = Bookmark.find(params[:id])

    @bookmark.assign_attributes(bookmark_params)

    if @bookmark.save
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", 20]]
UPDATE "bookmarks" SET "url" = ?, "updated_at" = ? WHERE "bookmarks"."id" = ?  [["url", "www.linkedin.com"], ["updated_at", "2018-03-01 03:51:03.921400"], ["id", 20]]

  def destroy
    @topic = Topic.find(params[:topic_id])
    @bookmark = Bookmark.find(params[:id])

    if @bookmark.destroy
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = ?  [["id", 4]]