app/controllers/likes_controller.rb

SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", 4]]
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "likes" ("bookmark_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["bookmark_id", 4], ["user_id", 6], ["created_at", "2018-03-12 17:41:28.883732"], ["updated_at", "2018-03-12 17:41:28.883732"]]
---
  def create
    @bookmark = Bookmark.find(params[:bookmark_id])
    @topic = Topic.find(params[:topic_id])
    like = current_user.likes.build(bookmark: @bookmark)

    authorize like

    if like.save

SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."id" = ? LIMIT 1  [["id", 12]]
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."bookmark_id" = ? LIMIT 1  [["user_id", 6], ["bookmark_id", 12]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 2]]
---
  def destroy
    @bookmark = Bookmark.find(params[:bookmark_id])
    @topic = Topic.find(params[:topic_id])
    like = Like.find_by(:user_id => current_user.id, :bookmark_id => params[:bookmark_id])

    authorize like

    if like.destroy