app/controllers/topics_controller.rb

SELECT "topics".* FROM "topics"
SELECT "bookmarks".* FROM "bookmarks"
---
  def index
    @topics = Topic.all
    @bookmarks = Bookmark.all

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", nil]]
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."topic_id" = ?  [["topic_id", 1]]
---
  def show
    @topic = Topic.find(params[:id])
    @bookmarks = Bookmark.where(topic_id: @topic.id)

INSERT INTO "topics" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "asdfghjk"], ["user_id", 1], ["created_at", "2018-02-28 21:17:22.607715"], ["updated_at", "2018-02-28 21:17:22.607715"]]
---
  def create
    @topic = Topic.new(topic_params)

    if @topic.save

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", 2]]
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 2]]
---
  def destroy
    @topic = Topic.find(params[:id])

    if @topic.destroy