app/controllers/users_controller.rb

  def show
    @user = User.find(current_user.id)
    @user_bookmarks = Bookmark.where(:user_id => current_user.id)
    @liked_bookmarks = Like.where(:user_id => current_user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 6]]
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = ?  [["user_id", 6]]
SELECT  "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."bookmark_id" = ?  ORDER BY "likes"."id" ASC LIMIT 1  [["user_id", 6], ["bookmark_id", 16]]